// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Rus");
    int a, b;
    cout << "Введите целочисленное значние для переменной a - ";
    cin >> a;
    cout << "Введите целочисленное значние для переменной b - ";
    cin >> b;
    cout << "Результат сложения a + b = " << a+b << endl;
    cout << "Результат разности a - b = " << a - b << endl;
    cout << "Результат умножения a * b = " << a * b << endl;
    cout << "Результат деления a / b = " << a / b << endl;
    double c, d;
    cout << "Введите дробное значние для переменной c - ";
    cin >> c;
    cout << "Введите дробное значние для переменной d - ";
    cin >> d;
    cout << "Результат сложения c + d = " << c + d << endl;
    cout << "Результат разности c - d = " << c - d << endl;
    cout << "Результат умножения c * d = " << c * d << endl;
    cout << "Результат деления c / d = " << c / d << endl;
    cout << "Введите целочисленное значние для переменной a - ";
    cin >> a;
    cout << "Введите дробное значение для переменной c - ";
    cin >> c;
    cout << "Результат сложения a + c = " << a + c << endl;
    cout << "Результат разности a - c = " << a - c << endl;
    cout << "Результат умножения a * c = " << a * c << endl;
    cout << "Результат деления a / c = " << a / c << endl;
    cout << "Введите дробное значение для переменной d - ";
    cin >> d;
    cout << "Введите целочисленное значние для переменной b - ";
    cin >> b;
    cout << "Результат сложения d + b = " << d + b << endl;
    cout << "Результат разности d - b = " << d - b << endl;
    cout << "Результат умножения d * b = " << d * b << endl;
    cout << "Результат деления d / b = " << d / b << endl;



}
